#### BuiltInFailures.GlobalParameterFailures Members

---

|  |
| --- |
| BuiltInFailures GlobalParameterFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures GlobalParameterFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | ElementPropLinkCircularChain | Linked properties in highlighted elements cause a circular chain of references. |
| Public property Static member | ElementPropLinkCircularChainError | Linked properties in highlighted elements cause a circular chain of references. |
| Public property Static member | GlobalParamFormulaCircularChain | A formula in a global parameter causes a circular chain of references between highlighted elements. |
| Public property Static member | GlobalParamFormulaCircularChainError | A formula in a global parameter causes a circular chain of references between highlighted elements. |
| Public property Static member | GlobalParamInvalidElemParamValue | Invalid value of parameter %1!s! in highlighted element. |
| Public property Static member | InvalidElementPropToGlobalParamLink | The following parameters of the highlighted element can no longer be linked to global parameters: %1!s!. |

# See Also

BuiltInFailures GlobalParameterFailures Class

Autodesk.Revit.DB Namespace